#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=strangely-steady-monkfish]
random_password.master: Refreshing state... [id=none]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.list_collections.module.integration_base.data.aws_caller_identity.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_response_processor.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.email_response_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-email-response-processor-dev]
module.email_response_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.memory.aws_dynamodb_table.basic-conversation_memory_table-table: Refreshing state... [id=levio-demo-fev-chat-history-dev]
module.email_request_processor.data.aws_ecr_image.lambda_image: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.email_request_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-email-request-processor-dev]
aws_iam_role.this: Refreshing state... [id=levio-demo-fev-api-role]
module.email_response_processor.module.fifo_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-response-processor-queue-dev.fifo]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.list_collections.data.aws_ecr_image.lambda_image: Reading...
module.email_response_processor.data.aws_caller_identity.current: Read complete after 1s [id=446872271111]
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.list_collections.module.integration_base.data.aws_caller_identity.current: Read complete after 1s [id=446872271111]
module.inference.module.integration_base.data.aws_caller_identity.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-memory-dev]
module.inference.module.integration_base.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
data.aws_cognito_user_pools.api_cognito: Reading...
aws_api_gateway_rest_api.this: Refreshing state... [id=d09uj3e9kh]
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev_dead_letter]
module.email_request_processor.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:609a924c6a2fbbc8155bbf6d5ac4fad64c75df021313dd37b4e994d1cda67abc]
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion-dev]
module.list_collections.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:e5ae74f0bb88409e4d2572d07f09cad8eee3901a57c8b34718cb8fdaff6385d2]
module.ingestion.data.aws_ecr_image.lambda_image: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_api_gateway_api_key.this: Refreshing state... [id=mwfvag0h0f]
module.email_response_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00fb300ee2d2f7b3b]
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.memory.module.lambda_function_container_image.data.aws_region.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.email_request_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.inference.module.integration_cognito.data.aws_caller_identity.current: Reading...
data.aws_cognito_user_pools.api_cognito: Read complete after 0s [id=estaec814cb7e6_userpool_814cb7e6-dev]
module.lex_router.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-lex-router-dev]
module.email_request_processor.module.fifo_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-request-processor-queue-dev.fifo]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.inference.module.integration_cognito.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_request_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1348983281]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.email_response_processor.data.aws_ecr_image.lambda_image: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.data.aws_ecr_image.lambda_image: Reading...
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage-dev]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:6db4b726287afb516d514e13c8f2c722da334745676878baef98a736a0c0376f]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3277652423]
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.email_response_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.lex_router.data.aws_ecr_image.lambda_image: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.inference.data.aws_ecr_image.lambda_image: Reading...
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
data.aws_ami.latest_amazon_linux: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.list_collections.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-list-collections-dev]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_availability_zones.available: Reading...
module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-inference-dev]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role]
module.email_response_processor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:6009c6ef6ec719221442d78736842942bb2ae9f96121510dc7e395bd351bf307]
module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role]
module.memory.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:a0d4849d7a630e4251412be440491ee4b2b42d6b115c03c84cbdf51ce71c7a79]
module.memory.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role]
module.lex_router.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:7735811a8f9ac6978670c7d7a904db1e7f1cc76422e7079745dfdb534ad54c08]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role]
module.inference.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:0e19f9c36b39aad540f8be6c30939b86d8c2959299a9c75d53d9f973325506d1]
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
aws_iam_role_policy.this: Refreshing state... [id=levio-demo-fev-api-role:this]
aws_api_gateway_account.this: Refreshing state... [id=api-gateway-account]
data.aws_ami.latest_amazon_linux: Read complete after 1s [id=ami-014d544cfef21b42d]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-inline]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.lex_router.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role]
module.memory.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-inline]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role]
module.list_collections.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role]
aws_api_gateway_authorizer.this: Refreshing state... [id=p9hrwu]
data.aws_secretsmanager_secret.password: Reading...
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|terraform-20240126151709956800000002]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2314128230]
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2463471094]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710029800000004]
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3325663242]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3522429600]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=52771042]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3953744684]
module.inference.module.integration_cognito.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=uvd5hn]
module.list_collections.module.integration_base.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=4z02sq]
module.inference.module.integration_base.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=nw7wpk]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=736838273]
module.email_request_processor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-processor-dev-role-logs]
module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-response-processor-dev-role-inline]
module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-response-processor-dev-role-logs]
module.memory.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-logs]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2926739739]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-logs]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-logs]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512646400000001]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2734712511]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-logs]
module.list_collections.module.integration_base.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-4z02sq-GET]
module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-logs]
data.aws_secretsmanager_secret_version.password: Reading...
module.inference.module.integration_base.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-nw7wpk-GET]
module.email_request_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-processor-dev-role-inline]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b9066ddfe118437e]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7ddd92ffe7cad50]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-086b3e733d88fa370]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-uvd5hn-OPTIONS]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-4z02sq-OPTIONS]
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|AWSCURRENT]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role-20240221194332717000000003]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role-20240221194307033600000001]
module.inference.module.integration_cognito.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-uvd5hn-GET]
module.inference.module.integration_base.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-nw7wpk-OPTIONS]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role-20240221194307124300000002]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710095500000006]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-0902cb6d437a968b6]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0b9900b5db426c576]
aws_security_group.lambda_egress_all_sg: Refreshing state... [id=sg-054f9a76901acf353]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512785600000002]
aws_security_group.sm_sg: Refreshing state... [id=sg-013ee0bdd16b8366f]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-20240126151710031000000005]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02f9981846a152b24]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09be498e3f465bbb5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbe5e0845bba1093]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04aae6346ab85dfe5]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0d1f5f95132e695a6]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-03f5acb4bc8b5d586]
module.list_collections.module.integration_base.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-list-collections-dev-collections-GET]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240130201651725000000001]
module.inference.module.integration_base.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev-inference-GET]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0f03a46a772c6a571]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-00ef44a2d775aaa99]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-uvd5hn-OPTIONS]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-uvd5hn-OPTIONS-200]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-20240126151710029200000003]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1366123725]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-4z02sq-OPTIONS]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-4z02sq-OPTIONS-200]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role-20240221194332764500000004]
module.inference.module.integration_cognito.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev-inferencecog-GET]
module.inference.module.integration_base.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-nw7wpk-OPTIONS]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev]
module.inference.module.integration_base.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-nw7wpk-OPTIONS-200]
aws_security_group.database_sg: Refreshing state... [id=sg-02511ace313a817bd]
aws_security_group.dynamo_db_sg: Refreshing state... [id=sg-0c6d3637458aa4799]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02f9981846a152b241080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db0a8005c04ca4f2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-066d9aa6005ec7c94]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform-dev]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0d7135c7f623e06f8]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-044bfd1713e1c30ec]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-uvd5hn-OPTIONS-200]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-07b8182fd57a40bc7]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0a8ed6effde8d7daf]
aws_vpc_endpoint.lambda_endpoint: Refreshing state... [id=vpce-0b1660c4cfd3c329e]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-4z02sq-OPTIONS-200]
aws_instance.jumpbox: Refreshing state... [id=i-002f0096e010e7064]
module.inference.module.integration_base.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-nw7wpk-OPTIONS-200]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-0fdf03f021658d47f]
aws_vpc_endpoint.dynamo_db_endpoint: Refreshing state... [id=vpce-04b83095daf470dae]
module.memory.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-memory-dev]
module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"]: Refreshing state... [id=sqs]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"]: Refreshing state... [id=6372d997-1ffe-4d2e-b58c-8870ba706c3d]
aws_db_instance.vector_db: Refreshing state... [id=db-KTG3TDKXH3C3BOXFTTIFJ5SASY]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1333636943]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-inline]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=242001761]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2560015702]
module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-inline]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240202005532784400000004]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-2024012615222187350000000e]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-2024012615222186470000000d]
module.inference.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-inference-dev]
module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev]
module.inference.module.integration_base.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-nw7wpk-GET]
module.inference.module.integration_cognito.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-uvd5hn-GET]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=ffdd3b10-6ac6-4fbf-bbd1-a7e6e82bf9d1]
module.list_collections.module.integration_base.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-4z02sq-GET]
aws_api_gateway_deployment.this: Refreshing state... [id=yhcaf2]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage-dev]
aws_api_gateway_stage.this: Refreshing state... [id=ags-d09uj3e9kh-dev]
aws_api_gateway_usage_plan.this: Refreshing state... [id=jxe0z0]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev]
aws_api_gateway_usage_plan_key.this: Refreshing state... [id=mwfvag0h0f]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"]: Refreshing state... [id=sqs]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"]: Refreshing state... [id=f9630eab-ef3d-41c7-bd22-d541cb86d9a8]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-request-processor-dev"
      ~ last_modified                  = "2024-02-25T16:47:31.000+0000" -> "2024-02-27T21:43:09.000+0000"
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ last_modified                  = "2024-02-25T16:47:01.000+0000" -> "2024-02-25T16:47:49.853+0000"
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-list-collections-dev"
      ~ last_modified                  = "2024-02-25T16:47:01.000+0000" -> "2024-02-25T16:47:49.854+0000"
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2024-02-25T16:47:30Z" -> (known after apply)
      ~ description   = "Deployment for 2024-02-25T16:47:30Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> (known after apply)
      ~ id            = "yhcaf2" -> (known after apply)
      ~ invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "2024-02-25T16:47:30Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "yhcaf2" -> (known after apply)
        id                    = "ags-d09uj3e9kh-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-request-processor-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_processor@sha256:5a9bb258e4d73319949499d6f0e7b9517377fa30e73e9f8f1960fc0520c333ed" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_processor@sha256:609a924c6a2fbbc8155bbf6d5ac4fad64c75df021313dd37b4e994d1cda67abc"
      ~ last_modified                  = "2024-02-27T21:43:09.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "API_KEY"   = (sensitive value)
              - "API_URL"   = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/dev/inference"
              - "QUEUE_URL" = "https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-response-processor-queue-dev.fifo"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-response-processor-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_response_processor@sha256:e3c2f28fc9cb984e08fd3693e640cfcd4e99534945851fb25b72cca32d29d1ae" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_response_processor@sha256:6009c6ef6ec719221442d78736842942bb2ae9f96121510dc7e395bd351bf307"
      ~ last_modified                  = "2024-02-25T16:47:00.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:f344739cae4741b27c0c0b77dd0cd4e1f7ccc0777d4f21699f17732726487ace" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:0e19f9c36b39aad540f8be6c30939b86d8c2959299a9c75d53d9f973325506d1"
      ~ last_modified                  = "2024-02-25T16:47:49.853+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-ingestion-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:d5fc78ac216a4ba77d320c8c412b7ddc9b40156df5a21f3b7fda4296b66bbe4a" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:6db4b726287afb516d514e13c8f2c722da334745676878baef98a736a0c0376f"
      ~ last_modified                  = "2024-02-25T16:47:01.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-lex-router-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:5609cf6ac84323a728608f972682818db169e286d3648a35f0724b5eeccae693" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:7735811a8f9ac6978670c7d7a904db1e7f1cc76422e7079745dfdb534ad54c08"
      ~ last_modified                  = "2024-02-25T16:47:01.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-list-collections-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:84725a1e6d69aad4f2c90cdc02910339372ab78f169e62d9730ee428de762bf3" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:e5ae74f0bb88409e4d2572d07f09cad8eee3901a57c8b34718cb8fdaff6385d2"
      ~ last_modified                  = "2024-02-25T16:47:49.854+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.memory.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-memory-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:0d5d712a2135a5b83d8208535ec8b97c5bce086475267ffbff8e200f49c279c1" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:a0d4849d7a630e4251412be440491ee4b2b42d6b115c03c84cbdf51ce71c7a79"
      ~ last_modified                  = "2024-02-25T16:47:01.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 8 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.tfplan"

```

</details>

*Pusher: @brunoabreu-levio, Action: `pull_request`, Workflow: `Deploy Lambdas & Terraform Plan on PR`*